fredcooke/FreeScale-s12x-binutils/gas/config/tc-mc9s12x.c
}

/* Try to identify the default target based on the BFD library.  */
static void
get_default_target (void)
{
  const bfd_target *target;
  bfd abfd;

  if (current_architecture != 0)
    return;

  default_cpu = "unknown";
  target = bfd_find_target (0, &abfd);
  if (target && target->name)
    {
      if (strcmp (target->name, "elf32-m68hc12") == 0)
	{
	  current_architecture = cpumc9s12x;
	  default_cpu = "mc9s12x";
	}
      else if (strcmp (target->name, "elf32-mc9s12x") == 0)
	{
      current_architecture = cpumc9s12x;
	  default_cpu = "mc9s12x";
	}
      else
	{
	  as_bad (_("Default target `%s' is not supported."), target->name);
	}
    }
}

void
mc9s12x_print_statistics (FILE *file)
{
  int i;
  struct mc9s12x_opcode_def *opc;

  hash_print_statistics (file, "opcode table", mc9s12x_hash);

  opc = mc9s12x_opcode_defs;
  if (opc == 0 || mc9s12x_nb_opcode_defs == 0)
    return;

  /* Dump the opcode statistics table.  */
  fprintf (file, _("Name   # Modes  Min ops  Max ops  Modes mask  # Used\n"));
  for (i = 0; i < mc9s12x_nb_opcode_defs; i++, opc++)
    {
      fprintf (file, "%-7.7s  %5d  %7d  %7d  0x%08lx  %7d\n",
	       opc->opcode->name,
	       opc->nb_modes,
	       opc->min_operands, opc->max_operands, opc->format, opc->used);
    }
}

int
md_parse_option (int c, char *arg)
{
  get_default_target ();
  switch (c)
    {
      /* -S means keep external to 2 bit offset rather than 16 bit one.  */
    case OPTION_SHORT_BRANCHES:
    case 'S':
      flag_fixed_branches = 1;
      break;

    case OPTION_FORCE_LONG_BRANCH:
      flag_force_long_jumps = 1;
      break;

    case OPTION_PRINT_INSN_SYNTAX:
      flag_print_insn_syntax = 1;
      break;

    case OPTION_PRINT_OPCODES:
      flag_print_opcodes = 1;
      break;

    case OPTION_STRICT_DIRECT_MODE:
      flag_strict_direct_addressing = 0;
      break;

    case OPTION_GENERATE_EXAMPLE:
      flag_print_opcodes = 2;
      break;

    case OPTION_MSHORT:
      elf_flags &= ~E_MC9S12X_I32;
      break;

    case OPTION_MLONG:
      elf_flags |= E_MC9S12X_I32;
      break;

    case OPTION_MSHORT_DOUBLE:
      elf_flags &= ~E_MC9S12X_F64;
      break;

    case OPTION_MLONG_DOUBLE:
      elf_flags |= E_MC9S12X_F64;
      break;

    case 'm':
      if (strcasecmp (arg, "MC9S12X") == 0)
	current_architecture = cpumc9s12x;
      else if (strcasecmp (arg, "MC9S12X") == 0)
	current_architecture = cpumc9s12x;
      else if (strcasecmp (arg, "68hcs12") == 0)
	current_architecture = cpumc9s12x | cpumc9s12x;
      else
	as_bad (_("Option `%s' is not recognized."), arg);
      break;

    default:
      return 0;
    }

  return 1;
}

symbolS *
md_undefined_symbol (char *name ATTRIBUTE_UNUSED)
{
  return 0;
}

char *
md_atof (int type, char *litP, int *sizeP)
{
  return ieee_md_atof (type, litP, sizeP, TRUE);
}

valueT
md_section_align (asection *seg, valueT addr)
{
  int align = bfd_get_section_alignment (stdoutput, seg);
  return ((addr + (1 << align) - 1) & (-1 << align));
}

static int
cmp_opcode (struct mc9s12x_opcode *op1, struct mc9s12x_opcode *op2)
{
  return strcmp (op1->name, op2->name);
}

#define IS_CALL_SYMBOL(MODE) \
(((MODE) & (MC9S12X_OP_PAGE|MC9S12X_OP_IND16)) \
  == ((MC9S12X_OP_PAGE|MC9S12X_OP_IND16)))

/* Initialize the assembler.  Create the opcode hash table
   (sorted on the names) with the M6811 opcode table
   (from opcode library).  */
void
md_begin (void)
{
  printf("\n IN MD_BEGIN\n"); /* TODO FOR TESTING */
  char *prev_name = "";
  struct mc9s12x_opcode *opcodes;
  struct mc9s12x_opcode_def *opc = 0;
  int i;  /* removed j */

  get_default_target ();

  mc9s12x_hash = hash_new ();

  opcodes = (struct mc9s12x_opcode *) xmalloc (mc9s12x_num_opcodes *
					       sizeof (struct
						       mc9s12x_opcode));
  mc9s12x_sorted_opcodes = opcodes;
  num_opcodes = 0;
  printf("\n seize of root structure %d",sizeof (struct mc9s12x_opcode)); //returns 16 SAME AS ORIGI code
  printf("\n size of opcodes %d \n",mc9s12x_num_opcodes);  //origional code returns 775  this returns 575 since we are dropping hc11 codes
  printf("\nCurrent arch is %d\n",current_architecture);  // this code returns 4 orig returns 4

  for (i = 0; i < mc9s12x_num_opcodes; i++)
    {
      if (mc9s12x_opcodes[i].arch & current_architecture)
      {
      opcodes[num_opcodes] = mc9s12x_opcodes[i];
	  if (opcodes[num_opcodes].name[0] == 'b'   /* get the first letter of the name */
	      && opcodes[num_opcodes].format & MC9S12X_OP_JUMP_REL
	      && !(opcodes[num_opcodes].format & MC9S12X_OP_BITMASK))
	    {
		//  printf("\n num_opcodes++ %s",opcodes[num_opcodes].name);  //should return 618
	      opcodes[num_opcodes] = mc9s12x_opcodes[i];
	    }
	  num_opcodes++;
	  /*
	   * since we are dropping hc11 the code below will be dropped, if this code is to be renabled mc9s12x_num_opcodes must be added to the size
	   * of the alias table or qsort will segfault  or something like that
	   */

	  /*for (j = 0; alias_opcodes[j].name != 0; j++)
	    if (strcmp (mc9s12x_opcodes[i].name, alias_opcodes[j].name) == 0)
	      {
		opcodes[num_opcodes] = mc9s12x_opcodes[i];
		opcodes[num_opcodes].name = alias_opcodes[j].alias;
		num_opcodes++;
		break;
	      }
	      */
	}
    }
  //print_opcode_list();
  //printf("\n number of OPcodes %d",num_opcodes);  //should be 599
  //printf("\n done building table\n");
  qsort (opcodes, num_opcodes, sizeof (struct mc9s12x_opcode),
         (int (*) (const void*, const void*)) cmp_opcode);

  //print_opcode_list();
  //printf("\n done sorting \n");

  opc = (struct mc9s12x_opcode_def *)
    xmalloc (num_opcodes * sizeof (struct mc9s12x_opcode_def));
  mc9s12x_opcode_defs = opc--;

  /* Insert unique names into hash table.  The M6811 instruction set
     has several identical opcode names that have different opcodes based
     on the operands.  This hash table then provides a quick index to
     the first opcode with a particular name in the opcode table.  */
  for (i = 0; i < num_opcodes; i++, opcodes++)
    {
      int expect;

      if (strcmp (prev_name, opcodes->name))
	{
	  prev_name = (char *) opcodes->name;

	  opc++;
	  opc->format = 0;
	  opc->min_operands = 100;
	  opc->max_operands = 0;
	  opc->nb_modes = 0;
	  opc->opcode = opcodes;
	  opc->used = 0;
	  hash_insert (mc9s12x_hash, opcodes->name, opc);
	}
      opc->nb_modes++;
      opc->format |= opcodes->format;

      /* See how many operands this opcode needs.  */
      expect = 0;
      if (opcodes->format & MC9S12X_OP_MASK)
	expect++;
      if (opcodes->format & MC9S12X_OP_BITMASK)
	expect++;
      if (opcodes->format & (MC9S12X_OP_JUMP_REL | MC9S12X_OP_JUMP_REL16))
	expect++;
      if (opcodes->format & (MC9S12X_OP_IND16_P2 | MC9S12X_OP_IDX_P2))
	expect++;
      /* Special case for call instruction.  */
      if ((opcodes->format & MC9S12X_OP_PAGE)
          && !(opcodes->format & MC9S12X_OP_IND16))
        expect++;

      if (expect < opc->min_operands)
	opc->min_operands = expect;
      if (IS_CALL_SYMBOL (opcodes->format))
         expect++;
      if (expect > opc->max_operands)
	opc->max_operands = expect;
    }
  opc++;
  mc9s12x_nb_opcode_defs = opc - mc9s12x_opcode_defs;


