fredcooke/FreeScale-s12x-binutils/gas/config/tc-mc9s12x.c
  p = skip_whites (p);

  if (*p == 0 || *p == '\n' || *p == '\r')
    {
      input_line_pointer = p;
      return 0;
    }

  if (*p == '*' && (opmode & (MC9S12X_OP_DIRECT | MC9S12X_OP_IND16)))
    {
      mode = MC9S12X_OP_DIRECT;
      p++;
    }
  else if (*p == '#')
    {
      if (!(opmode & (MC9S12X_OP_IMM8 | MC9S12X_OP_IMM16 | MC9S12X_OP_BITMASK)))
	{
	  as_bad (_("Immediate operand is not allowed for operand %d."),
		  which);
	  return -1;
	}

      mode = MC9S12X_OP_IMM16;
      p++;
      if (strncmp (p, "%hi", 3) == 0)
	{
	  p += 3;
	  mode |= MC9S12X_OP_HIGH_ADDR;
	}
      else if (strncmp (p, "%lo", 3) == 0)
	{
	  p += 3;
	  mode |= MC9S12X_OP_LOW_ADDR;
	}
      /* %page modifier is used to obtain only the page number
         of the address of a function.  */
      else if (strncmp (p, "%page", 5) == 0)
	{
	  p += 5;
	  mode |= MC9S12X_OP_PAGE_ADDR;
	}

      /* %addr modifier is used to obtain the physical address part
         of the function (16-bit).  For 68HC12 the function will be
         mapped in the 16K window at 0x8000 and the value will be
         within that window (although the function address may not fit
         in 16-bit).  See bfd/elf32-m68hc12.c for the translation.  */
      else if (strncmp (p, "%addr", 5) == 0)
	{
	  p += 5;
	  mode |= MC9S12X_OP_CALL_ADDR;
	}
    }
  else if (*p == '.' && (p[1] == '+' || p[1] == '-'))
    {
      p++;
      mode = MC9S12X_OP_JUMP_REL;
    }
  else if (*p == '[')
    {
	  /* TODO fix */
      if (current_architecture & cpumc9s12x)
	as_bad (_("Indirect indexed addressing is not valid for 68HC11."));

      p++;
      mode = MC9S12X_OP_D_IDX;
      p = skip_whites (p);
    }
  else if (*p == ',')		/* Special handling of ,x and ,y.  */
    {
      p++;
      input_line_pointer = p;

      reg = register_name ();
      if (reg != REG_NONE)
	{
	  oper->reg1 = reg;
	  oper->exp.X_op = O_constant;
	  oper->exp.X_add_number = 0;
	  printf("\n adding a numper to expression on line1054");
	  oper->mode = MC9S12X_OP_IDX;
	  return 1;
	}
      as_bad (_("Spurious `,' or bad indirect register addressing mode."));
      return -1;
    }
  /* Handle 68HC12 page specification in 'call foo,%page(bar)'.  */
  else if ((opmode & MC9S12X_OP_PAGE) && strncmp (p, "%page", 5) == 0)
    {
      p += 5;
      mode = MC9S12X_OP_PAGE_ADDR |MC9S12X_OP_PAGE | MC9S12X_OP_IND16;
    }
  input_line_pointer = p;

  if (mode == MC9S12X_OP_NONE || mode == MC9S12X_OP_D_IDX)
    reg = register_name ();
  else
    reg = REG_NONE;

  if (reg != REG_NONE)
    {
      p = skip_whites (input_line_pointer);
      if (*p == ']' && mode == MC9S12X_OP_D_IDX)
	{
	  as_bad
	    (_("Missing second register or offset for indexed-indirect mode."));
	  return -1;
	}

      oper->reg1 = reg;
      oper->mode = mode | MC9S12X_OP_REG;
      if (*p != ',')
	{
	  if (mode == MC9S12X_OP_D_IDX)
	    {
	      as_bad (_("Missing second register for indexed-indirect mode."));
	      return -1;
	    }
	  return 1;
	}

      p++;
      input_line_pointer = p;
      reg = register_name ();
      if (reg != REG_NONE)
	{
	  p = skip_whites (input_line_pointer);
	  if (mode == MC9S12X_OP_D_IDX)
	    {
	      if (*p != ']')
		{
		  as_bad (_("Missing `]' to close indexed-indirect mode."));
		  return -1;
		}
	      p++;
              oper->mode = MC9S12X_OP_D_IDX;
	    }
	  input_line_pointer = p;

	  oper->reg2 = reg;
	  return 1;
	}
      return 1;
    }

  /* In MRI mode, isolate the operand because we can't distinguish
     operands from comments.  */
  if (flag_mri)
    {
      char c = 0;

      p = skip_whites (p);
      while (*p && *p != ' ' && *p != '\t')
	p++;

      if (*p)
	{
	  c = *p;
	  *p = 0;
	}

      /* Parse as an expression.  */
      expression (&oper->exp);
      printf("\n read expression line 1137");

      if (c)
	{
	  *p = c;
	}
    }
  else
    {
      expression (&oper->exp);
      //printf("\n read expression line 1147, %d",(int) oper.exp->X_unsigned);
    }

  if (oper->exp.X_op == O_illegal)
    {
      as_bad (_("Illegal operand."));
      return -1;
    }
  else if (oper->exp.X_op == O_absent)
    {
      as_bad (_("Missing operand."));
      return -1;
    }

  p = input_line_pointer;

  if (mode == MC9S12X_OP_NONE || mode == MC9S12X_OP_DIRECT
      || mode == MC9S12X_OP_D_IDX)
    {
      p = skip_whites (input_line_pointer);

      if (*p == ',')
	{
	  int possible_mode = MC9S12X_OP_NONE;
	  char *old_input_line;

	  old_input_line = p;
	  p++;

	  /* 68HC12 pre increment or decrement.  */
	  if (mode == MC9S12X_OP_NONE)
	    {
	      if (*p == '-')
		{
		  possible_mode = MC9S12X_PRE_DEC;
		  p++;
		}
	      else if (*p == '+')
		{
		  possible_mode = MC9S12X_PRE_INC;
		  p++;
		}
	      p = skip_whites (p);
	    }
	  input_line_pointer = p;
	  reg = register_name ();

	  /* Backtrack if we have a valid constant expression and
	     it does not correspond to the offset of the 68HC12 indexed
	     addressing mode (as in N,x).  */
	  if (reg == REG_NONE && mode == MC9S12X_OP_NONE
	      && possible_mode != MC9S12X_OP_NONE)
	    {
	      oper->mode = MC9S12X_OP_IND16 | MC9S12X_OP_JUMP_REL;
	      input_line_pointer = skip_whites (old_input_line);
	      return 1;
	    }

	  if (possible_mode != MC9S12X_OP_NONE)
	    mode = possible_mode;

	  if ((current_architecture & cpumc9s12x)
	      && possible_mode != MC9S12X_OP_NONE)
	    as_bad (_("Pre-increment mode is not valid for 68HC11"));
	  /* Backtrack.  */
	  if (which == 0 && opmode & MC9S12X_OP_IDX_P2
	      && reg != REG_X && reg != REG_Y
	      && reg != REG_PC && reg != REG_SP)
	    {
	      reg = REG_NONE;
	      input_line_pointer = p;
	    }

	  if (reg == REG_NONE && mode != MC9S12X_OP_DIRECT
	      && !(mode == MC9S12X_OP_NONE && opmode & MC9S12X_OP_IND16))
	    {
	      as_bad (_("Wrong register in register indirect mode."));
	      return -1;
	    }
	  if (mode == MC9S12X_OP_D_IDX)
	    {
	      p = skip_whites (input_line_pointer);
	      if (*p++ != ']')
		{
		  as_bad (_("Missing `]' to close register indirect operand."));
		  return -1;
		}
	      input_line_pointer = p;
              oper->reg1 = reg;
              oper->mode = MC9S12X_OP_D_IDX_2;
              return 1;
	    }
	  if (reg != REG_NONE)
	    {
	      oper->reg1 = reg;
	      if (mode == MC9S12X_OP_NONE)
		{
		  p = input_line_pointer;
		  if (*p == '-')
		    {
		      mode = MC9S12X_POST_DEC;
		      p++;
		      if (current_architecture & cpumc9s12x)
			as_bad
			  (_("Post-decrement mode is not valid for 68HC11."));
		    }
		  else if (*p == '+')
		    {
		      mode = MC9S12X_POST_INC;
		      p++;
		      if (current_architecture & cpumc9s12x)
			as_bad
			  (_("Post-increment mode is not valid for 68HC11."));
		    }
		  else
		    mode = MC9S12X_OP_IDX;

		  input_line_pointer = p;
		}
	      else
		mode |= MC9S12X_OP_IDX;

	      oper->mode = mode;
	      return 1;
	    }
          input_line_pointer = old_input_line;
	}

      if (mode == MC9S12X_OP_D_IDX_2)
	{
	  as_bad (_("Invalid indexed indirect mode."));
	  return -1;
	}
    }

  /* If the mode is not known until now, this is either a label
     or an indirect address.  */
  if (mode == MC9S12X_OP_NONE)
    mode = MC9S12X_OP_IND16 | MC9S12X_OP_JUMP_REL;

