fredcooke/FreeScale-s12x-binutils/gas/config/tc-mc9s12x.c
  p = input_line_pointer;
  while (*p == ' ' || *p == '\t')
    p++;
  input_line_pointer = p;
  oper->mode = mode;

  return 1;
}

#define MC9S12X_AUTO_INC_DEC (MC9S12X_PRE_INC | MC9S12X_PRE_DEC \
                            | MC9S12X_POST_INC | MC9S12X_POST_DEC)

/* Checks that the number 'num' fits for a given mode.  */
static int
check_range (long num, int mode)
{
  /* Auto increment and decrement are ok for [-8..8] without 0.  */
  if (mode & MC9S12X_AUTO_INC_DEC)
    return (num != 0 && num <= 8 && num >= -8);

  /* The 68HC12 supports 5, 9 and 16-bit offsets.  */
  if (mode & (MC9S12X_INDEXED_IND | MC9S12X_INDEXED | MC9S12X_OP_IDX))
    mode = MC9S12X_OP_IND16;

  if (mode & MC9S12X_OP_JUMP_REL16)
    mode = MC9S12X_OP_IND16;

  mode &= ~MC9S12X_OP_BRANCH;
  switch (mode)
    {
    case MC9S12X_OP_IX:
    case MC9S12X_OP_IY:
    case MC9S12X_OP_DIRECT:
      return (num >= 0 && num <= 255) ? 1 : 0;

    case MC9S12X_OP_BITMASK:
    case MC9S12X_OP_IMM8:
    case MC9S12X_OP_PAGE:
      return (((num & 0xFFFFFF00) == 0) || ((num & 0xFFFFFF00) == 0xFFFFFF00))
	? 1 : 0;

    case MC9S12X_OP_JUMP_REL:
      return (num >= -128 && num <= 127) ? 1 : 0;

    case MC9S12X_OP_IND16:
    case MC9S12X_OP_IND16 | MC9S12X_OP_PAGE:
    case MC9S12X_OP_IMM16:
      return (((num & 0xFFFF0000) == 0) || ((num & 0xFFFF0000) == 0xFFFF0000))
	? 1 : 0;

    case MC9S12X_OP_IBCC_MARKER:
    case MC9S12X_OP_TBCC_MARKER:
    case MC9S12X_OP_DBCC_MARKER:
      return (num >= -256 && num <= 255) ? 1 : 0;

    case MC9S12X_OP_TRAP_ID:
      return ((num >= 0x30 && num <= 0x39)
	      || (num >= 0x40 && num <= 0x0ff)) ? 1 : 0;

    default:
      return 0;
    }
}

/* Gas fixup generation.  */

/* Put a 1 byte expression described by 'oper'.  If this expression contains
   unresolved symbols, generate an 8-bit fixup.  */
static void
fixup8 (expressionS *oper, int mode, int opmode)
{
  char *f;

  f = frag_more (1);

  if (oper->X_op == O_constant)
    {
      if (mode & MC9S12X_OP_TRAP_ID
	  && !check_range (oper->X_add_number, MC9S12X_OP_TRAP_ID))
	{
	  static char trap_id_warn_once = 0;

	  as_bad (_("Trap id `%ld' is out of range."), oper->X_add_number);
	  if (trap_id_warn_once == 0)
	    {
	      trap_id_warn_once = 1;
	      as_bad (_("Trap id must be within [0x30..0x39] or [0x40..0xff]."));
	    }
	}

      if (!(mode & MC9S12X_OP_TRAP_ID)
	  && !check_range (oper->X_add_number, mode))
	{
	  as_bad (_("Operand out of 8-bit range: `%ld'."), oper->X_add_number);
	}
      number_to_chars_bigendian (f, oper->X_add_number & 0x0FF, 1);
    }
  else if (oper->X_op != O_register)
    {
      if (mode & MC9S12X_OP_TRAP_ID)
	as_bad (_("The trap id must be a constant."));

      if (mode == MC9S12X_OP_JUMP_REL)
	{
	  fixS *fixp;

	  fixp = fix_new_exp (frag_now, f - frag_now->fr_literal, 1,
			      oper, TRUE, BFD_RELOC_8_PCREL);
	  fixp->fx_pcrel_adjust = 1;
	}
      else
	{
	  fixS *fixp;
          int reloc;

	  /* Now create an 8-bit fixup.  If there was some %hi, %lo
	     or %page modifier, generate the reloc accordingly.  */
          if (opmode & MC9S12X_OP_HIGH_ADDR)
            reloc = BFD_RELOC_MC9S12X_HI8;
          else if (opmode & MC9S12X_OP_LOW_ADDR)
            reloc = BFD_RELOC_MC9S12X_LO8;
          else if (opmode & MC9S12X_OP_PAGE_ADDR)
            reloc = BFD_RELOC_MC9S12X_PAGE;
          else
            reloc = BFD_RELOC_8;

	  fixp = fix_new_exp (frag_now, f - frag_now->fr_literal, 1,
                              oper, FALSE, reloc);
          if (reloc != BFD_RELOC_8)
            fixp->fx_no_overflow = 1;
	}
      number_to_chars_bigendian (f, 0, 1);
    }
  else
    {
      as_fatal (_("Operand `%x' not recognized in fixup8."), oper->X_op);
    }
}

/* Put a 2 byte expression described by 'oper'.  If this expression contains
   unresolved symbols, generate a 16-bit fixup.  */
static void
fixup16 (expressionS *oper, int mode, int opmode ATTRIBUTE_UNUSED)
{
  char *f;

  f = frag_more (2);

  if (oper->X_op == O_constant)
    {
      if (!check_range (oper->X_add_number, mode))
	{
	  as_bad (_("Operand out of 16-bit range: `%ld'."),
		  oper->X_add_number);
	}
      number_to_chars_bigendian (f, oper->X_add_number & 0x0FFFF, 2);
      printf("\n in fixup16 line 1444, %d",(signed int) oper->X_add_number & 0x0FFFF);
    }
  else if (oper->X_op != O_register)
    {
      fixS *fixp;
      int reloc;

      if ((opmode & MC9S12X_OP_CALL_ADDR) && (mode & MC9S12X_OP_IMM16))
        reloc = BFD_RELOC_MC9S12X_LO16;
      else if (mode & MC9S12X_OP_JUMP_REL16)
        reloc = BFD_RELOC_16_PCREL;
      else if (mode & MC9S12X_OP_PAGE)
        reloc = BFD_RELOC_MC9S12X_LO16;
      else
        reloc = BFD_RELOC_16;

      /* Now create a 16-bit fixup.  */
      fixp = fix_new_exp (frag_now, f - frag_now->fr_literal, 2,
			  oper,
			  reloc == BFD_RELOC_16_PCREL,
                          reloc);
      number_to_chars_bigendian (f, 0, 2);
      if (reloc == BFD_RELOC_16_PCREL)
	fixp->fx_pcrel_adjust = 2;
      if (reloc == BFD_RELOC_MC9S12X_LO16)
        fixp->fx_no_overflow = 1;
    }
  else
    {
      as_fatal (_("Operand `%x' not recognized in fixup16."), oper->X_op);
    }
}

/* Put a 3 byte expression described by 'oper'.  If this expression contains
   unresolved symbols, generate a 24-bit fixup.  */
static void
fixup24 (expressionS *oper, int mode, int opmode ATTRIBUTE_UNUSED)
{
  char *f;

  f = frag_more (3);

  if (oper->X_op == O_constant)
    {
      if (!check_range (oper->X_add_number, mode))
	{
	  as_bad (_("Operand out of 16-bit range: `%ld'."),
		  oper->X_add_number);
	}
      number_to_chars_bigendian (f, oper->X_add_number & 0x0FFFFFF, 3);
      printf("\n in fixup24 line 1494");
    }
  else if (oper->X_op != O_register)
    {
      fixS *fixp;

      /* Now create a 24-bit fixup.  */
      fixp = fix_new_exp (frag_now, f - frag_now->fr_literal, 3,
			  oper, FALSE, BFD_RELOC_MC9S12X_24);
      number_to_chars_bigendian (f, 0, 3);
    }
  else
    {
      as_fatal (_("Operand `%x' not recognized in fixup16."), oper->X_op);
    }
}

/* 68HC11 and 68HC12 code generation.  */

/* Translate the short branch/bsr instruction into a long branch.  */
static unsigned char
convert_branch (unsigned char code)
{
  if (IS_OPCODE (code, MC9S12X_BSR2))
    return MC9S12X_JSR;
  else if (IS_OPCODE (code, MC9S12X_BSR))
    return MC9S12X_JSR;
  else if (IS_OPCODE (code, MC9S12X_BRA))
    return (current_architecture & cpumc9s12x) ? MC9S12X_JMP2 : MC9S12X_JMP2;
  else
    as_fatal (_("Unexpected branch conversion with `%x'"), code);

