fredcooke/FreeScale-s12x-binutils/gas/config/tc-mc9s12x.c
  /* The 68HC12 movb and movw instructions are special.  We have to handle
     them in a special way.  */
  if (format & (MC9S12X_OP_IND16_P2 | MC9S12X_OP_IDX_P2))
    {
      move_insn = 1;
      if (format & MC9S12X_OP_IDX)
	{
	  build_indexed_byte (&operands[0], format, 1);
	  i = 1;
	  format &= ~MC9S12X_OP_IDX;
	}
      if (format & MC9S12X_OP_IDX_P2)
	{
	  build_indexed_byte (&operands[1], format, 1);
	  i = 0;
	  format &= ~MC9S12X_OP_IDX_P2;
	}
    }

  if (format & (MC9S12X_OP_DIRECT | MC9S12X_OP_IMM8))
    {
      fixup8 (&operands[i].exp,
	      format & (MC9S12X_OP_DIRECT | MC9S12X_OP_IMM8 | MC9S12X_OP_TRAP_ID),
	      operands[i].mode);
      i++;
    }
  else if (IS_CALL_SYMBOL (format) && nb_operands == 1)
    {
      format &= ~MC9S12X_OP_PAGE;
      fixup24 (&operands[i].exp, format & MC9S12X_OP_IND16,
	       operands[i].mode);
      i++;
    }
  else if (format & (MC9S12X_OP_IMM16 | MC9S12X_OP_IND16))
    {
      fixup16 (&operands[i].exp,
               format & (MC9S12X_OP_IMM16 | MC9S12X_OP_IND16 | MC9S12X_OP_PAGE),
	       operands[i].mode);
      i++;
    }
  else if (format & (MC9S12X_OP_IX | MC9S12X_OP_IY))
    {
      if ((format & MC9S12X_OP_IX) && (operands[0].reg1 != REG_X))
	as_bad (_("Invalid indexed register, expecting register X."));
      if ((format & MC9S12X_OP_IY) && (operands[0].reg1 != REG_Y))
	as_bad (_("Invalid indexed register, expecting register Y."));

      fixup8 (&operands[0].exp, MC9S12X_OP_IX, operands[0].mode);
      i = 1;
    }
  else if (format &
	   (MC9S12X_OP_IDX | MC9S12X_OP_IDX_2 | MC9S12X_OP_IDX_1
            | MC9S12X_OP_D_IDX | MC9S12X_OP_D_IDX_2))
    {
      build_indexed_byte (&operands[i], format, move_insn);
      i++;
    }
  else if (format & MC9S12X_OP_REG && current_architecture & cpumc9s12x)
    {
      build_reg_mode (&operands[i], format);
      i++;
    }
  if (format & MC9S12X_OP_BITMASK)
    {
      fixup8 (&operands[i].exp, MC9S12X_OP_BITMASK, operands[i].mode);
      i++;
    }
  if (format & MC9S12X_OP_JUMP_REL)
    {
      fixup8 (&operands[i].exp, MC9S12X_OP_JUMP_REL, operands[i].mode);
    }
  else if (format & MC9S12X_OP_IND16_P2)
    {
      fixup16 (&operands[1].exp, MC9S12X_OP_IND16, operands[1].mode);
    }
  if (format & MC9S12X_OP_PAGE)
    {
      fixup8 (&operands[i].exp, MC9S12X_OP_PAGE, operands[i].mode);
    }
}

/* Opcode identification and operand analysis.  */

/* find() gets a pointer to an entry in the opcode table.  It must look at all
   opcodes with the same name and use the operands to choose the correct
   opcode.  Returns the opcode pointer if there was a match and 0 if none.  */
static struct mc9s12x_opcode *
find (struct mc9s12x_opcode_def *opc, operand operands[], int nb_operands)
{
  int i, match, pos;
  struct mc9s12x_opcode *opcode;
  struct mc9s12x_opcode *op_indirect;

  op_indirect = 0;
  opcode = opc->opcode;

  /* Now search the opcode table table for one with operands
     that matches what we've got.  We're only done if the operands matched so
     far AND there are no more to check.  */
  for (pos = match = 0; match == 0 && pos < opc->nb_modes; pos++, opcode++)
    {
      int poss_indirect = 0;
      long format = opcode->format;
      int expect;

      expect = 0;
      if (opcode->format & MC9S12X_OP_MASK)
	expect++;
      if (opcode->format & MC9S12X_OP_BITMASK)
	expect++;
      if (opcode->format & (MC9S12X_OP_JUMP_REL | MC9S12X_OP_JUMP_REL16))
	expect++;
      if (opcode->format & (MC9S12X_OP_IND16_P2 | MC9S12X_OP_IDX_P2))
	expect++;
      if ((opcode->format & MC9S12X_OP_PAGE)
          && (!IS_CALL_SYMBOL (opcode->format) || nb_operands == 2))
        expect++;

      for (i = 0; expect == nb_operands && i < nb_operands; i++)
	{
	  int mode = operands[i].mode;

	  if (mode & MC9S12X_OP_IMM16)
	    {
	      if (format &
		  (MC9S12X_OP_IMM8 | MC9S12X_OP_IMM16 | MC9S12X_OP_BITMASK))
		continue;
	      break;
	    }
	  if (mode == MC9S12X_OP_DIRECT)
	    {
	      if (format & MC9S12X_OP_DIRECT)
		continue;

	      /* If the operand is a page 0 operand, remember a
	         possible <abs-16> addressing mode.  We mark
	         this and continue to check other operands.  */
	      if (format & MC9S12X_OP_IND16
		  && flag_strict_direct_addressing && op_indirect == 0)
		{
		  poss_indirect = 1;
		  continue;
		}
	      break;
	    }
	  if (mode & MC9S12X_OP_IND16)
	    {
	      if (i == 0 && (format & MC9S12X_OP_IND16) != 0)
		continue;
              if (i != 0 && (format & MC9S12X_OP_PAGE) != 0)
                continue;
	      if (i != 0 && (format & MC9S12X_OP_IND16_P2) != 0)
		continue;
	      if (i == 0 && (format & MC9S12X_OP_BITMASK))
		break;
	    }
	  if (mode & (MC9S12X_OP_JUMP_REL | MC9S12X_OP_JUMP_REL16))
	    {
	      if (format & (MC9S12X_OP_JUMP_REL | MC9S12X_OP_JUMP_REL16))
		continue;
	    }
	  if (mode & MC9S12X_OP_REG)
	    {
	      if (i == 0
		  && (format & MC9S12X_OP_REG)
		  && (operands[i].reg2 == REG_NONE))
		continue;
	      if (i == 0
		  && (format & MC9S12X_OP_REG)
		  && (format & MC9S12X_OP_REG_2)
		  && (operands[i].reg2 != REG_NONE))
		continue;
	      if (i == 0
		  && (format & MC9S12X_OP_IDX)
		  && (operands[i].reg2 != REG_NONE))
		continue;
	      if (i == 0
		  && (format & MC9S12X_OP_IDX)
		  && (format & (MC9S12X_OP_IND16_P2 | MC9S12X_OP_IDX_P2)))
		continue;
	      if (i == 1
		  && (format & MC9S12X_OP_IDX_P2))
		continue;
	      break;
	    }
	  if (mode & MC9S12X_OP_IDX)
	    {
	      if (format & MC9S12X_OP_IX && operands[i].reg1 == REG_X)
		continue;
	      if (format & MC9S12X_OP_IY && operands[i].reg1 == REG_Y)
		continue;
	      if (i == 0
		  && format & (MC9S12X_OP_IDX | MC9S12X_OP_IDX_1 | MC9S12X_OP_IDX_2)
		  && (operands[i].reg1 == REG_X
		      || operands[i].reg1 == REG_Y
		      || operands[i].reg1 == REG_SP
		      || operands[i].reg1 == REG_PC))
		continue;
	      if (i == 1 && format & MC9S12X_OP_IDX_P2)
		continue;
	    }
          if (mode & format & (MC9S12X_OP_D_IDX | MC9S12X_OP_D_IDX_2))
            {
              if (i == 0)
                continue;
            }
	  if (mode & MC9S12X_AUTO_INC_DEC)
	    {
	      if (i == 0
		  && format & (MC9S12X_OP_IDX | MC9S12X_OP_IDX_1 |
			       MC9S12X_OP_IDX_2))
		continue;
	      if (i == 1 && format & MC9S12X_OP_IDX_P2)
		continue;
	    }
	  break;
	}
      match = i == nb_operands;

