fredcooke/FreeScale-s12x-binutils/gas/config/tc-mc9s12x.c
    case BFD_RELOC_MC9S12X_HI8:
      value = value >> 8;
      /* Fall through.  */

    case BFD_RELOC_MC9S12X_LO8:
    case BFD_RELOC_8:
    case BFD_RELOC_MC9S12X_PAGE:
      ((bfd_byte *) where)[0] = (bfd_byte) value;
      break;

    case BFD_RELOC_8_PCREL:
      ((bfd_byte *) where)[0] = (bfd_byte) value;

      if (value < -128 || value > 127)
	as_bad_where (fixP->fx_file, fixP->fx_line,
		      _("Value %ld too large for 8-bit PC-relative branch."),
		      value);
      break;

    case BFD_RELOC_MC9S12X_3B:
      if (value <= 0 || value > 8)
	as_bad_where (fixP->fx_file, fixP->fx_line,
		      _("Auto increment/decrement offset '%ld' is out of range."),
		      value);
      if (where[0] & 0x8)
	value = 8 - value;
      else
	value--;

      where[0] = where[0] | (value & 0x07);
      break;

    case BFD_RELOC_MC9S12X_5B:
      if (value < -16 || value > 15)
	as_bad_where (fixP->fx_file, fixP->fx_line,
		      _("Offset out of 5-bit range for movw/movb insn: %ld"),
		      value);
      if (value >= 0)
	where[0] |= value;
      else 
	where[0] |= (0x10 | (16 + value));
      break;

    case BFD_RELOC_MC9S12X_RL_JUMP:
    case BFD_RELOC_MC9S12X_RL_GROUP:
    case BFD_RELOC_VTABLE_INHERIT:
    case BFD_RELOC_VTABLE_ENTRY:
      fixP->fx_done = 0;
      return;

    default:
      as_fatal (_("Line %d: unknown relocation type: 0x%x."),
		fixP->fx_line, fixP->fx_r_type);
    }
}

/* Set the ELF specific flags.  */
void
mc9s12x_elf_final_processing (void)
{
	/* TODO make this always true */
  if (current_architecture & cpumc9s12x)
    elf_flags |= EF_MC9S12X_MACH;
  elf_elfheader (stdoutput)->e_flags &= ~EF_MC9S12X_ABI;
  elf_elfheader (stdoutput)->e_flags |= elf_flags;
}
